# -*- mode: org; fill-column: 78; -*-
# Time-stamp: <2024-08-12 19:15:42 krylon>
#
#+TAGS: internals(i) ui(u) bug(b) feature(f)
#+TAGS: database(d) design(e), meditation(m)
#+TAGS: optimize(o) refactor(r) cleanup(c)
#+TODO: TODO(t)  RESEARCH(r) IMPLEMENT(i) TEST(e) | DONE(d) FAILED(f) CANCELLED(c)
#+TODO: MEDITATE(m) PLANNING(p) | SUSPENDED(s)
#+PRIORITIES: A G D

* Silo
  Silo gathers system logs from multiple systems and provides a searchable
  aggregate view and notifications.
** Clock table
   #+BEGIN: clocktable :scope file :maxlevel 202 :emphasize t
   #+CAPTION: Clock summary at [2024-08-12 Mo 19:15]
   | Headline               | Time   |        |      |
   |------------------------+--------+--------+------|
   | *Total time*           | *3:27* |        |      |
   |------------------------+--------+--------+------|
   | *Silo*                 | *3:27* |        |      |
   | \_  /Components [0/0]/ |        | /3:27/ |      |
   | \_    Database [0/0]   |        |        | 3:27 |
   #+END:
** Features [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
** Components [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
*** Extractor [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    I need to get data out of the system log(s). On BSD systems, this should
    be easy, on Linux systems using journald, it should be possible at the
    very least.
    ... Oh, I see there are Python bindings to talk to systemd. Okay, that
    shouldn't be too hard. (Of course, those are famous last words)
**** Journald
     There are Python bindings to access journald logs, it seems pretty
     straightforward.
*** Database [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2024-08-12 Mo 18:44]--[2024-08-12 Mo 19:15] =>  0:31
    CLOCK: [2024-08-12 Mo 17:47]--[2024-08-12 Mo 18:01] =>  0:14
    CLOCK: [2024-08-10 Sa 22:30]--[2024-08-11 So 00:14] =>  1:44
    CLOCK: [2024-08-10 Sa 21:19]--[2024-08-10 Sa 22:17] =>  0:58
    :END:
*** Network [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    So, do I want to use HTTP or some crude custom protocol?
**** Server [0/0]
**** Agent [0/0]
**** Service Discovery [0/0]
** Bugs [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
